app/Http/Controllers/CategoryController.php

    public function index(Request $request): View
    {
        $searchTerm = $request->input('q');

        if ($searchTerm) {
            $categorys = Category::search($searchTerm)->paginate(15);
        } else {
            $categorys = Category::latest()->paginate(15);
---
select * from "category" order by "created_at" desc limit 15 offset 0
select count(*) as aggregate from "category"

    public function show(Category $category)
    {
        $categorys = Category::all();
---
select * from "category"

    public function update(Request $request, Category $category): RedirectResponse
    {
        $request->validate([
            'CategoryName' => 'required',
            'CategoryDescription' => 'required'
        ]);
        //dd($request->all());
        $category->update($request->all());
---
update "category" set "CategoryDescription" = 'Material de uso rudo.', "updated_at" = '2023-11-03 13:49:29' where "id" = 10

    public function destroy(Category $category): RedirectResponse
    {
        try {
            $category->delete();
---
delete from "category" where "id" = 10