app/Http/Controllers/PartnersController.php

select * from "partners" order by "created_at" desc limit 15 offset 0
select count(*) as aggregate from "partners"
---
    public function index(Request $request): View
    {
        $searchTerm = $request->input('q');

        if ($searchTerm) {
            $partner = Partners::search($searchTerm)->paginate(15);
        } else {
            $partner = Partners::latest()->paginate(15);

select * from "partners" where "partners"."id" = '6' limit 1
---
    public function edit($partners): View
    {
        $partner = Partners::find($partners);