app/Http/Controllers/ProductController.php

    public function index(): View
    {
        $products = Product::latest()->paginate(15);
---
select * from "product" order by "created_at" desc limit 15 offset 0
select count(*) as aggregate from "product"

    public function show(Product $product)
    {
        $products = Product::all();
---
select * from "product"

    public function destroy(Product $product)
    {

        try {
            $product->delete();
---
delete from "product" where "id" = 6