app/Http/Controllers/Transaction_DetailsController.php

select * from "transaction_details" order by "created_at" desc limit 15 offset 0
select count(*) as aggregate from "transaction_details"
---
    public function index(Request $request): View
    {
        $searchTerm = $request->input('q');

        if ($searchTerm) {
            $details = Transaction_Details::search($searchTerm)->paginate(15);
        } else {
            $details = Transaction_Details::latest()->paginate(15);

select * from "product"
select * from "transaction"
---
    public function edit(Transaction_Details $transaction_Details)
    {
        //$detail = Transaction_Details::find($transaction_Details->id);
        $detail = Transaction_Details::find($transaction_Details);
        $product = Product::all();
        $tran = Transaction::all();