app/Http/Controllers/TransactionController.php

    public function index(Request $request):View
    {
        $searchTerm = $request->input('q');

        if ($searchTerm) {
            $transaction = Transaction::search($searchTerm)->paginate(15);
        } else {
            $transaction = Transaction::latest()->paginate(15);
---
select * from "transaction" order by "created_at" desc limit 15 offset 0
select count(*) as aggregate from "transaction"

    public function store(Request $request): RedirectResponse
    {
        //dd($request->all());
        $request->validate([
        'TransactionDate' => 'required',
        'Partner_id' => 'required',
        'TotalAmount' => 'required',
        'TransactionType' => 'required'
    ]);
        Transaction::create($request->all());
        return redirect()->route('transaction.index')->with('success', 'Nueva Transacción creada exitosamente!');
---
select * from "transaction"